Reports/АнализПосещенийПоТочкамКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>АнализПосещенийПоТочкамКонтроля</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ДвиженияДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияДоступа</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДлительностьПосещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пропуск</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыПроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Посетитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Посетители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвижения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ДвиженияПропусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияПропусков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоДнейДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипПропуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПропусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПосещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пропуск</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропуска</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропускаНаТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Инциденты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>Инциденты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СерьезностьИнцидента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пропуск</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропуска</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропускаНаТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнцидента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыДвижения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыДвижения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВыдачаПропуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ВыдачаПропуска</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияПропусков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПропуск</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПропуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПропусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыПропусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричиныПосещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПосещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/АнализПосещенийПоТочкамКонтроля/Forms/ФормаОтчета/Ext/Form/Module.bsl
// Процедура-обработчик команды печати
Процедура ПечатьАнализПосещений(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
    // Получаем даты из формы-источника или используем значения по умолчанию
    Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
        ДатаНачала = ПараметрыВыполненияКоманды.Источник.ДатаНачала;
        ДатаОкончания = ПараметрыВыполненияКоманды.Источник.ДатаОкончания;
    Иначе
        ДатаНачала = НачалоДня(ТекущаяДата());
        ДатаОкончания = КонецДня(ТекущаяДата());
    КонецЕсли;
    
    // Формируем печатную форму
    ТабличныйДокумент = СформироватьПечатнуюФорму(ДатаНачала, ДатаОкончания);
    
    // Настройки страницы для листа A4
    ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    ТабличныйДокумент.ПолеСлева = 5;
    ТабличныйДокумент.ПолеСправа = 5;
    ТабличныйДокумент.ПолеСверху = 5;
    ТабличныйДокумент.ПолеСнизу = 5;
    ТабличныйДокумент.АвтоМасштаб = Истина;
    
    // Выводим документ
    ТабличныйДокумент.Показать("Анализ посещений по точкам контроля");
КонецПроцедуры

// Функция для получения объединённой таблицы по физическим лицам с учётом периода
Функция ПолучитьТаблицуПоФизическимЛицам(ДатаНачала, ДатаОкончания) 
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ДвиженияДоступа.Посетитель КАК Посетитель,
    |   ДвиженияПропусков.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ДвиженияДоступа.Пропуск.Представление КАК Пропуск,
    |   ДвиженияДоступа.ТочкаКонтроля КАК ТочкаКонтроля,
    |   ДвиженияДоступа.ТипДвижения КАК ТипДвижения,
    |   ДвиженияДоступа.ДлительностьПосещения КАК ДлительностьПосещения,
    |   ДвиженияДоступа.ДатаВремя КАК ДатаВремя,
    |   ЕСТЬNULL(Инциденты.СерьезностьИнцидента, 0) КАК СерьезностьИнцидента,
    |   ЕСТЬNULL(Инциденты.ДатаИнцидента, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаИнцидента
    |ИЗ
    |   РегистрНакопления.ДвиженияДоступа КАК ДвиженияДоступа
    |   ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияПропусков КАК ДвиженияПропусков
    |   ПО ДвиженияДоступа.Пропуск = ДвиженияПропусков.Пропуск
    |       И ДвиженияПропусков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
    |       И ДвиженияПропусков.Пропуск ССЫЛКА Документ.ВыдачаПропуска
    |   ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Инциденты КАК Инциденты
    |   ПО ДвиженияДоступа.Пропуск = Инциденты.Пропуск
    |ГДЕ
    |   ДвиженияДоступа.ТипДвижения В (ЗНАЧЕНИЕ(Перечисление.ТипыДвижения.Вход), ЗНАЧЕНИЕ(Перечисление.ТипыДвижения.Выход))
    |   И ДвиженияДоступа.Пропуск ССЫЛКА Документ.ВыдачаПропуска
    |   И (ДвиженияДоступа.ДатаВремя МЕЖДУ &ДатаНачала И &ДатаОкончания ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1,1,1))
    |УПОРЯДОЧИТЬ ПО
    |   ФизическоеЛицо,
    |   ДатаВремя";
    
    // Установка параметров периода
    Если Не ЗначениеЗаполнено(ДатаНачала) Или Не ЗначениеЗаполнено(ДатаОкончания) Тогда
        Запрос.УстановитьПараметр("ДатаНачала", Дата(1,1,1)); // Минимальная дата для всех данных
        Запрос.УстановитьПараметр("ДатаОкончания", Дата(3999,12,31)); // Максимальная дата
    Иначе
        Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
        Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания)); // Учитываем весь день
    КонецЕсли;

    РезультатЗапроса = Запрос.Выполнить();
    Если ТипЗнч(РезультатЗапроса) <> Тип("РезультатЗапроса") Тогда
        Сообщить("Ошибка: Результат запроса имеет неверный тип: " + ТипЗнч(РезультатЗапроса));
        ТаблицаПоФизическимЛицам = Новый ТаблицаЗначений;
        ТаблицаПоФизическимЛицам.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
        ТаблицаПоФизическимЛицам.Колонки.Добавить("Записи", Новый ОписаниеТипов("ТаблицаЗначений"));
        Возврат ТаблицаПоФизическимЛицам;
    КонецЕсли;
    
    Если РезультатЗапроса.Пустой() Тогда
        Сообщить("Результат запроса пустой. Проверьте данные в регистре ДвиженияДоступа.");
        ТаблицаПоФизическимЛицам = Новый ТаблицаЗначений;
        ТаблицаПоФизическимЛицам.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
        ТаблицаПоФизическимЛицам.Колонки.Добавить("Записи", Новый ОписаниеТипов("ТаблицаЗначений"));
        Возврат ТаблицаПоФизическимЛицам;
    КонецЕсли;
    
    ТаблицаРезультат = РезультатЗапроса.Выгрузить();
    
    // Группировка по ФизическоеЛицо
    ТаблицаПоФизическимЛицам = Новый ТаблицаЗначений;
    ТаблицаПоФизическимЛицам.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
    ТаблицаПоФизическимЛицам.Колонки.Добавить("Записи", Новый ОписаниеТипов("ТаблицаЗначений"));
    
    Для Каждого Строка Из ТаблицаРезультат Цикл
        СтрокаГруппы = ТаблицаПоФизическимЛицам.Найти(Строка.ФизическоеЛицо, "ФизическоеЛицо");
        Если СтрокаГруппы = НеОпределено Тогда
            СтрокаГруппы = ТаблицаПоФизическимЛицам.Добавить();
            СтрокаГруппы.ФизическоеЛицо = Строка.ФизическоеЛицо;
            СтрокаГруппы.Записи = Новый ТаблицаЗначений;
            СтрокаГруппы.Записи.Колонки.Добавить("Посетитель", Новый ОписаниеТипов("СправочникСсылка.Посетители"));
            СтрокаГруппы.Записи.Колонки.Добавить("Пропуск", Новый ОписаниеТипов("Строка"));
            СтрокаГруппы.Записи.Колонки.Добавить("ТочкаКонтроля", Новый ОписаниеТипов("СправочникСсылка.ТочкиКонтроля"));
            СтрокаГруппы.Записи.Колонки.Добавить("ТипДвижения", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыДвижения"));
            СтрокаГруппы.Записи.Колонки.Добавить("ДлительностьПосещения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
            СтрокаГруппы.Записи.Колонки.Добавить("СерьезностьИнцидента", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
            СтрокаГруппы.Записи.Колонки.Добавить("ДатаИнцидента", Новый ОписаниеТипов("Дата"));
            СтрокаГруппы.Записи.Колонки.Добавить("ДатаВремя", Новый ОписаниеТипов("Дата")); 
		КонецЕсли;
        
        НоваяСтрока = СтрокаГруппы.Записи.Добавить();
        НоваяСтрока.Посетитель = Строка.Посетитель;
        НоваяСтрока.Пропуск = Строка.Пропуск;
        НоваяСтрока.ТочкаКонтроля = Строка.ТочкаКонтроля;
        НоваяСтрока.ТипДвижения = Строка.ТипДвижения;
        НоваяСтрока.ДлительностьПосещения = Строка.ДлительностьПосещения;
        НоваяСтрока.СерьезностьИнцидента = Строка.СерьезностьИнцидента;
        НоваяСтрока.ДатаИнцидента = Строка.ДатаИнцидента;
        НоваяСтрока.ДатаВремя = Строка.ДатаВремя; 
	КонецЦикла;
    
    Возврат ТаблицаПоФизическимЛицам;
КонецФункции

// Функция формирования печатной формы
Функция СформироватьПечатнуюФорму(ДатаНачала, ДатаОкончания) 
    ТабличныйДокумент = Новый ТабличныйДокумент; 
    Макет = Отчеты.АнализПосещенийПоТочкамКонтроля.ПолучитьМакет("АнализПосещений");
    
    ТаблицаПоФизическимЛицам = ПолучитьТаблицуПоФизическимЛицам(ДатаНачала, ДатаОкончания);
    
    ТабличныйДокумент.Очистить(); 
    
    // Вывод заголовка 
    ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
    Если ОбластьЗаголовок.Области.Количество() > 0 И Найти(ОбластьЗаголовок.Области[0].Текст, "Отчёт не сформирован") > 0 Тогда
        ОбластьЗаголовок.Области[0].Текст = "Анализ посещений по точкам контроля";
    КонецЕсли; 
    
    ОбластьЗаголовок.Параметры.ДатаФормирования = Формат(ТекущаяДата(), "ДФ='dd.MM.yyyy'");
    ТабличныйДокумент.Вывести(ОбластьЗаголовок);
    
    // Добавляем пустую область для отступа
    ОбластьПустая = Новый ТабличныйДокумент;
    ОбластьПустая.Область(1, 1, 1, 1).ВысотаСтроки = 12; 
	ТабличныйДокумент.Вывести(ОбластьПустая);
    
    // Шапка таблицы 
    ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
    ОбластьШапкаТаблицы.Параметры.Посетитель = "Посетитель";
    ОбластьШапкаТаблицы.Параметры.Пропуск = "Пропуск";
    ОбластьШапкаТаблицы.Параметры.ТочкаКонтроля = "Точка контроля";
    ОбластьШапкаТаблицы.Параметры.ТипДвижения = "Тип движения";
    ОбластьШапкаТаблицы.Параметры.ДлительностьПосещения = "Длительность посещения";
    ОбластьШапкаТаблицы.Параметры.СерьезностьИнцидента = "Серьезность инцидента";
    ОбластьШапкаТаблицы.Параметры.ДатаИнцидента = "Дата инцидента";
    ОбластьШапкаТаблицы.Параметры.ДатаВремя = "Дата и время"; 
	
    ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
    
    ТабличныйДокумент.НачатьАвтоГруппировкуСтрок();
    
    Для Каждого СтрокаГруппа Из ТаблицаПоФизическимЛицам Цикл
        // Область для группы (ФизическоеЛицо)
        ОбластьГруппа = Макет.ПолучитьОбласть("ШапкаТаблицы"); 
        ОбластьГруппа.Параметры.Посетитель = Строка(СтрокаГруппа.ФизическоеЛицо);
        ОбластьГруппа.Параметры.Пропуск = "";
        ОбластьГруппа.Параметры.ТочкаКонтроля = "";
        ОбластьГруппа.Параметры.ТипДвижения = "";
        ОбластьГруппа.Параметры.ДлительностьПосещения = "";
        ОбластьГруппа.Параметры.СерьезностьИнцидента = "";
        ОбластьГруппа.Параметры.ДатаИнцидента = "";
        ОбластьГруппа.Параметры.ДатаВремя = ""; 
		
        ТабличныйДокумент.Вывести(ОбластьГруппа, 1); // Уровень группировки 1
        
        // Области для деталей
        ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
        Если ТипЗнч(СтрокаГруппа.Записи) = Тип("ТаблицаЗначений") Тогда
            Для Каждого СтрокаДетали Из СтрокаГруппа.Записи Цикл
                ОбластьСтрокаТаблицы.Параметры.ФизическоеЛицо = "";
                ОбластьСтрокаТаблицы.Параметры.Пропуск = ?(ЗначениеЗаполнено(СтрокаДетали.Пропуск), СтрокаДетали.Пропуск, "");
                ОбластьСтрокаТаблицы.Параметры.ТочкаКонтроля = ?(ЗначениеЗаполнено(СтрокаДетали.ТочкаКонтроля), Строка(СтрокаДетали.ТочкаКонтроля), "");
                ОбластьСтрокаТаблицы.Параметры.ТипДвижения = ?(ЗначениеЗаполнено(СтрокаДетали.ТипДвижения), Строка(СтрокаДетали.ТипДвижения), "");
                ОбластьСтрокаТаблицы.Параметры.ДлительностьПосещения = ?(ЗначениеЗаполнено(СтрокаДетали.ДлительностьПосещения), СтрокаДетали.ДлительностьПосещения, 0);
                ОбластьСтрокаТаблицы.Параметры.СерьезностьИнцидента = ?(ЗначениеЗаполнено(СтрокаДетали.СерьезностьИнцидента), СтрокаДетали.СерьезностьИнцидента, 0);
                ОбластьСтрокаТаблицы.Параметры.ДатаИнцидента = ?(ЗначениеЗаполнено(СтрокаДетали.ДатаИнцидента), Формат(СтрокаДетали.ДатаИнцидента, "ДФ='dd.MM.yyyy'"), "");
                ОбластьСтрокаТаблицы.Параметры.ДатаВремя = ?(ЗначениеЗаполнено(СтрокаДетали.ДатаВремя), Формат(СтрокаДетали.ДатаВремя, "ДФ='dd.MM.yyyy HH:mm:ss'"), ""); // Добавлено значение ДатаВремя
                
                ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы, 2); // Уровень детализации 2
            КонецЦикла;
        КонецЕсли;
    КонецЦикла;
    
    // Завершаем авто-группировку
    ТабличныйДокумент.ЗакончитьАвтоГруппировкуСтрок();
    
    // Разрешаем изменение ширины колонок, но запрещаем редактирование данных
    ТабличныйДокумент.Защита = Ложь; 
    ТабличныйДокумент.ТолькоПросмотр = Истина; 
	
    Возврат ТабличныйДокумент;
	
КонецФункции

// Процедура для формирования отчета на сервере и вывода в реквизит формы
&НаСервере
Процедура СформироватьОтчетНаСервере()  
	
    Результат.Очистить(); 
    ТабличныйДокумент = СформироватьПечатнуюФорму(ДатаНачала, ДатаОкончания); 
    Результат = ТабличныйДокумент; 
    ОбновитьОтображениеДанныхНаСервере(); 
	
КонецПроцедуры

// Обработчик команды кнопки "Сформировать"
&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
    СформироватьОтчетНаСервере();
    ОбновитьОтображениеДанных();
	
КонецПроцедуры   

// Обработчик команды кнопки "Печать"
&НаКлиенте 
Процедура ПечатьОтчета(Команда)  
	
    Попытка
        // Формируем печатную форму на сервере
        ТабличныйДокумент = СформироватьПечатнуюФорму(ДатаНачала, ДатаОкончания);
        Если ТабличныйДокумент = Неопределено Тогда
            Сообщить("Не удалось сформировать печатную форму.");
            Возврат;
        КонецЕсли;
        
        // Настройки страницы для листа A4
        ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
        ТабличныйДокумент.ПолеСлева = 5;
        ТабличныйДокумент.ПолеСправа = 5;
        ТабличныйДокумент.ПолеСверху = 5;
        ТабличныйДокумент.ПолеСнизу = 5;
        ТабличныйДокумент.АвтоМасштаб = Истина;

        // Выводим документ
        ТабличныйДокумент.Показать("Анализ посещений по точкам контроля");
    Исключение
        Сообщить("Ошибка при формировании печатной формы: " + ОписаниеОшибки());
    КонецПопытки; 
	
КонецПроцедуры

// Функция получения печатной формы на сервере (для совместимости)
&НаСервере 
Функция ПолучитьПечатнуюФормуНаСервере() 
	
	Возврат СформироватьПечатнуюФорму(ДатаНачала, ДатаОкончания);   
	
КонецФункции

// При создании формы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Инициализация параметров формы
    Результат.Очистить(); // Очищаем начальное состояние
    
    // Установка значений по умолчанию для дат
    Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
        ДатаНачала = НачалоДня(ТекущаяДата());
    КонецЕсли;
    Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда
        ДатаОкончания = КонецДня(ТекущаяДата());
	КонецЕсли;     
	
КонецПроцедуры

// Процедура для обновления отображения на сервере
&НаСервере
Процедура ОбновитьОтображениеДанныхНаСервере()
    // Пустая процедура для принудительного обновления
КонецПроцедуры
